package Core.CMD;

public class cmd {
    /*
    Для компиляции программы вначале в командной строке/терминале с помощью команды cd перейдем к нужной папке,
    где находится нужный каталог (например каталог study).
    cd C:\java
    (Например, файл с исходным кодом расположен по пути C:\java\study\Program.java).)
    Для компиляции выполним команду
    javac study\Program.java
    После этого в папке study появятся скомпилированные файлы Program.class и Person.class.
    Для запуска программы выполним команду:
    java study.Program
     */
}
