package AbstractClass;

public class AbstractClass {
    /*
    В абстрактном классе тоже можно определить поля и методы,
    но в то же время нельзя создать объект или экземпляр абстрактного класса

    При определении абстрактных классов используется ключевое слово abstract.
public abstract class Human {
    private String name;
    public String getName() {
        return name;
    }
}
мы не можем использовать конструктор абстрактного класса для создания его объекта.

Абстрактный класс может содержать абстрактные методы.
Такие методы определяются с помощью ключевого слова abstract и не имеют никакой реализации:
public abstract void display();

Абстрактные классы только с одним абстрактным методом не могут использовать лямбда-выражения.

Абстрактные классы:

Могут иметь любые экземпляры или статические переменные, изменяемые или неизменяемые.

Класс может расширять только один абстрактный класс.

Могут иметь экземпляр изменяемых полей, параметров или локальных переменных.

Абстрактные классы только с одним абстрактным методом не могут использовать лямбда-выражения.

Могут иметь конструктор.

Могут иметь любые методы.
     */
}
