package Core.AccessModifiers;

public class AccessModifiersУточнения {
    /*
    Доступ к классам
По умолчанию классы верхнего уровня доступны в том пакете, в котором они определены.

    Доступ к членам класса
Члены класса всегда доступны внутри тела класса.
По умолчанию члены класса также доступны в пакете, в котором класс определен.

    Модификатор public

Для класса, не являющегося вложенным, может быть указан только один из двух возможных уровней доступа:
заданный по умолчанию и public.
Когда класс объявлен как public, он должен быть единственным public классом, объявленным в файле,
и имя файла должно совпадать с именем класса.

    Модификатор protected
Классы и интерфейсы верхнего уровня не могут быть объявлены как protected.

    Модификатор private
Классы и интерфейсы верхнего уровня не могут быть объявлены как private.
     */
}
