package Core;

public class Breakpoints {
    /*
    Точки останова
    https://www.jetbrains.com/help/idea/using-breakpoints.html#breakpoint-statuses
    Переключить точку останова строки: Ctrl+F8
    Изменение свойств точки останова: Ctrl+Shift+F8

    Типы точек останова
     -Точки останова строки:
    приостановить программу по достижении строки кода, в которой была установлена точка останова.
     Этот тип точек останова может быть установлен для любой исполняемой строки кода.
     -Точки останова метода:
    приостановка программы при входе или выходе из указанного метода или одной из его реализаций,
    что позволяет проверить условия входа/выхода метода.
    - Точки наблюдения за полями:
    приостановка программы при чтении или записи указанного поля.
    Это позволяет реагировать на взаимодействия с определенными переменными экземпляра.
    Например, если в конце сложного процесса вы получаете явно неправильное значение на одном из ваших полей,
    установка точки наблюдения за полем может помочь определить происхождение ошибки.
    - Точки останова исключения:
    приостановка программы при создании ее подклассов.
    Они применяются глобально к условию исключения и не требуют конкретной ссылки на исходный код.Throwable
     */
    /*
Включение/отключение точек останова
     При удалении точки останова ее внутренняя конфигурация теряется.
     Чтобы временно отключить отдельную точку останова без потери ее параметров, ее можно отключить:
    Для точек останова без исключений:
    щелкните их правой кнопкой мыши и установите параметр Включено по мере необходимости.
    Вы также можете переключить их средней кнопкой мыши, если ей не назначено удаление точек останова.
    Для всех точек останова:
    щелкните Просмотреть точки останова и установите или снимите флажок с точки останова в списке.Ctrl+Shift+F8
     */
}
