public class Test1 {
    //requireNonNullElse(T obj, T defaultObj)
    //Возвращает - первый аргумент, если он не- и В противном случае второй аргумент, если он не является -nullnull

    //nonNull(Object obj)
    //Возвращается true, если предоставленная ссылка не является - в противном случае возвращает .truenullfalse

    /*понятия класса и объекта.
    для того, чтобы в нашей программе появился объект, нужно совершить два действия:
    1) Его нужно описать. Какие свойства и методы есть у этого объекта.
    2) Его нужно создать
     */

}
